{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 258], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add", "inbound_nodes": [["input_1", 0, 0, {"y": [[0.04436958208680153, -0.047112297266721725, 0.01767275109887123, -0.03493157774209976, -0.0408373698592186, 0.008597005158662796, 0.0064564235508441925, 0.0180717371404171, 0.02989828959107399, -0.044999122619628906, 0.013346139341592789, -0.001225888729095459, -0.04621053859591484, -0.00925368070602417, -0.01322096586227417, 0.03923382982611656, -0.022504592314362526, 0.02223740890622139, -0.013812411576509476, 0.012292109429836273, -0.03399582952260971, 0.044025447219610214, -0.04404677078127861, -0.002454567700624466, -0.039491117000579834, -0.012170232832431793, -0.006212376058101654, -0.028545547276735306, 0.02274836227297783, -4.521757364273071e-05, -0.0480194091796875, 0.041922677308321, -0.010022569447755814, 0.01589890941977501, 0.014526430517435074, -0.011600352823734283, 0.04879046604037285, 0.0136786587536335, -0.03613696247339249, -0.04002929851412773, -0.04927342012524605, 0.0075303539633750916, -0.021976565942168236, -0.04635831341147423, 0.004583738744258881, -0.013779498636722565, -0.027905631810426712, -0.022659873589873314, 0.04838984087109566, 0.03196669742465019, -0.0307741891592741, 0.015778306871652603, -0.03736795112490654, 0.022226084023714066, -0.03680419921875, -0.024849021807312965, -0.03447144106030464, -0.017540443688631058, -0.04226196929812431, -0.0003407485783100128, -0.037837374955415726, 0.022762764245271683, -0.0358227863907814, 0.04973471537232399, 0.011303354054689407, -0.026734579354524612, 0.027606789022684097, 0.03668222203850746, 0.024279367178678513, -0.017587758600711823, 0.011957872658967972, 0.020420696586370468, -0.041274845600128174, 0.01912451907992363, -0.005600273609161377, -0.01950686052441597, 0.04203787073493004, -0.0026428699493408203, 0.017933879047632217, 0.027055110782384872, -0.03170409053564072, 0.018940519541502, -0.04916205629706383, 0.002087067812681198, 0.041250769048929214, 0.04842039570212364, 0.02686377987265587, -0.018227826803922653, -0.024421561509370804, -0.005328476428985596, 0.008057426661252975, 0.042040515691041946, -0.01275113970041275, 0.0014799721539020538, -0.013862181454896927, -0.04759202152490616, -0.04105259105563164, -0.04752716049551964, 0.04989520087838173, -0.016830958425998688, 0.027345050126314163, -0.0363040566444397, -0.04034249857068062, -0.03649332374334335, 0.025698218494653702, -0.04518627002835274, -0.012485038489103317, -0.027870167046785355, 0.007242977619171143, 0.030907046049833298, 0.0472833551466465, 0.03014865145087242, 0.0019154548645019531, 0.006809316575527191, 0.030093643814325333, -0.034954749047756195, 0.008472107350826263, 0.005262099206447601, -0.018025599420070648, 0.0464448444545269, 0.0014063715934753418, 0.0165754072368145, 0.010321032255887985, -0.007505975663661957, -0.005141366273164749, -0.022401725873351097, -0.006912898272275925, -0.009101223200559616, 0.030311260372400284, -0.013785254210233688, 0.03200339153409004, -0.04459948465228081, -0.032642293721437454, 0.006877817213535309, 0.029849324375391006, 0.04513463005423546, 0.015452075749635696, -0.024381423369050026, -0.0046502575278282166, -0.004509247839450836, 0.03305934742093086, -0.021985340863466263, -0.02408844232559204, -0.001396477222442627, 0.04363057389855385, 0.04080367460846901, 0.03717171028256416, -0.006276298314332962, -0.04575752094388008, 0.010289598256349564, 0.044931236654520035, 0.023795414716005325, 0.02506348118185997, -0.015916846692562103, 0.04423234239220619, 0.022842828184366226, -0.012601137161254883, 0.0343683622777462, 0.04618122801184654, -0.027834152802824974, -0.003031991422176361, 0.012900780886411667, 0.015341054648160934, -0.041131891310214996, -0.009344376623630524, 0.03241744264960289, 0.023032519966363907, 0.04920328035950661, -0.0013584867119789124, -0.026257110759615898, 0.01884588971734047, 0.01514904573559761, 0.040670108050107956, -0.03230791166424751, -0.047468699514865875, -0.014342926442623138, 0.04867205396294594, 0.014612745493650436, -0.02759634330868721, 0.015098001807928085, -0.02514932118356228, -0.006503202021121979, -0.005087651312351227, 0.036493901163339615, 0.044477906078100204, 0.01562664285302162, 0.03292917087674141, 0.009074628353118896, 0.043022897094488144, 0.0326034314930439, -0.019083714112639427, -0.03112342394888401, -0.0062326788902282715, 0.03983722999691963, 0.02794518694281578, 0.01907552406191826, -0.001710258424282074, -0.045017506927251816, -0.0034568533301353455, -0.009350050240755081, 0.012508522719144821, 0.014892969280481339, 0.02530653402209282, -0.0353676900267601, 0.030600856989622116, 0.021725822240114212, 0.037401046603918076, -0.04416150972247124, -0.043605100363492966, -0.04293471574783325, 0.04463418945670128, -0.02679072692990303, -0.015280425548553467, -0.012654423713684082, 0.0064928531646728516, -0.024799859151244164, -0.008926201611757278, 0.015550617128610611, 0.026648689061403275, 0.028975415974855423, -0.03310441970825195, -0.007730673998594284, 0.04342268779873848, 0.031182337552309036, -0.020999550819396973, -0.0263710618019104, 0.019405197352170944, 0.045297298580408096, 0.0026542916893959045, -0.02170945517718792, -0.025372004136443138, 0.011245153844356537, -0.019944990053772926, 0.047804925590753555, -0.04495439678430557, -0.03963423892855644, -0.01478024572134018, 0.04433324560523033, 0.019570376724004745, 0.046168554574251175, -0.01758851855993271, -0.010866355150938034, -0.0012529008090496063, 0.012203335762023926, 0.03951365873217583, -0.013072371482849121, 0.03116774931550026, 0.0021317601203918457, -0.025995684787631035, 0.0003125891089439392, -0.009407781064510345, -0.015719283372163773, -0.025680243968963623, -0.018403612077236176, -0.04013340547680855, 0.02900094911456108, -0.04916422441601753, 0.008888494223356247], [0.04796556010842323, -0.02658820152282715, -0.014730691909790039, 0.03727572038769722, -0.03041290119290352, -0.01774071529507637, -0.0006310716271400452, 0.038165975362062454, -0.027871156111359596, 0.02563159540295601, 0.03970276191830635, -0.04456641897559166, -0.024576663970947266, -0.010325420647859573, 0.028487037867307663, 0.04337438568472862, -0.04763549566268921, -0.0030133724212646484, 0.03472086414694786, -0.042990636080503464, -0.03390403091907501, 0.049098383635282516, 0.025254059582948685, -0.03296147659420967, 0.04663657024502754, 0.010453570634126663, 0.004667770117521286, -0.015827156603336334, 0.039160240441560745, 0.0317249558866024, 0.016295406967401505, 0.04416361078619957, -0.04327665641903877, -0.03476830571889877, -0.03253382444381714, -0.0474773533642292, -0.018278788775205612, 0.04938856139779091, 0.0289401076734066, 0.040071818977594376, 0.019345436245203018, 0.0037502869963645935, 0.027190852910280228, 0.005448959767818451, 0.04858844354748726, 0.00574493408203125, 0.020650338381528854, 0.025154415518045425, 0.03891018405556679, 0.026018332690000534, -0.019738877192139626, 0.0038981661200523376, -0.029138529673218727, -0.012304376810789108, -0.01676947996020317, -0.006982278078794479, -0.011322103440761566, 0.022588063031435013, 0.04935789480805397, 0.049593400210142136, -0.03479764610528946, 0.02606261894106865, 0.024837758392095566, 0.016907300800085068, 0.04586397483944893, 0.03187760338187218, 0.03412053361535072, 0.043587494641542435, 0.02201371267437935, -0.04223452880978584, 0.03314800187945366, 0.02232063189148903, 0.02909228578209877, -0.03344781696796417, -0.003318618983030319, 0.024701688438653946, -0.04623241350054741, 0.0014640465378761292, -0.022023214027285576, 0.0025633573532104492, 0.04903772100806236, -0.005467772483825684, 0.028923023492097855, -0.008465610444545746, 0.04667108133435249, -0.04557821899652481, 0.028394054621458054, 0.025785479694604874, -0.035608746111392975, -0.047155916690826416, -0.009673774242401123, 0.0016236528754234314, -0.03602103143930435, 0.028754200786352158, 0.045045170933008194, 0.030939888209104538, 0.019237373024225235, 0.03700609132647514, -0.0037560947239398956, 0.027727309614419937, 0.03773539140820503, -0.015226531773805618, 0.029825691133737564, -0.03279902786016464, -0.02471749857068062, -0.01164177805185318, -0.01643134281039238, 0.044291902333498, 0.004925739020109177, 0.026754427701234818, 0.027719367295503616, 0.033794764429330826, -0.0038430318236351013, -0.02428661659359932, 0.03767627850174904, 0.042879868298769, 0.03961911424994469, 0.006397534161806107, 0.03335278108716011, 0.010906051844358444, 0.011346112936735153, 0.006970562040805817, 0.04574615880846977, 0.046008024364709854, -0.006998348981142044, 0.016063224524259567, 0.012048028409481049, 0.0320955254137516, -0.03263230621814728, -0.019372273236513138, 0.003064192831516266, -0.02549844980239868, -0.029118334874510765, 0.01293894276022911, 0.04396791383624077, 0.03936529532074928, 0.0056695230305194855, -0.019964218139648438, 0.0038197413086891174, -0.012130819261074066, 0.04469773545861244, 0.04984085634350777, 0.04963293299078941, 0.028942380100488663, -0.03300914913415909, -0.02210850827395916, -0.03921717405319214, -0.025702202692627907, -0.038368724286556244, 0.043865326792001724, 0.0037217624485492706, 0.00533130019903183, -0.03686358779668808, 0.003519989550113678, 0.026542317122220993, -0.006931997835636139, 0.010536301881074905, 0.029228631407022476, 0.045718539506196976, -0.0456501841545105, -0.047470081597566605, -0.04492224380373955, 0.0012007243931293488, -0.004628706723451614, 0.00942070409655571, 0.031420301645994186, 0.04100504890084267, -0.03793761879205704, 0.023517433553934097, -0.029622936621308327, 0.014302913099527359, -0.041475556790828705, 0.009522952139377594, 0.02462301030755043, -0.04587686061859131, 0.025716353207826614, 0.009926367551088333, 0.02913771942257881, 0.04256144538521767, -0.029402554035186768, 0.005422722548246384, 0.012693140655755997, -0.0050246939063072205, -0.008231677114963531, -0.006841935217380524, -0.01028437539935112, 0.022964272648096085, -0.046487342566251755, 0.009063184261322021, -0.011903978884220123, 0.024854931980371475, 0.02781735733151436, -0.01541081815958023, -0.03589261695742607, 0.03343755379319191, 0.0454145111143589, 0.029581699520349503, -0.01503516361117363, -0.015664301812648773, -0.021154463291168213, -0.03439350053668022, 0.02944643422961235, -0.037422336637973785, 0.026843156665563583, -0.027759147807955742, 0.04513276740908623, -0.037930928170681, 0.048456933349370956, 0.04444878175854683, 0.0004876628518104553, 0.039443206042051315, -0.01097632572054863, -0.0177772156894207, 0.04113686457276344, -0.0026540160179138184, 0.04272652044892311, 0.019908618181943893, 0.011292338371276855, 0.004068516194820404, -0.02910311333835125, 0.008183490484952927, -0.02268925867974758, -0.046018149703741074, 0.01053696870803833, 0.028391603380441666, 5.512312054634094e-05, -0.04099823161959648, 0.025036562234163284, -0.037140488624572754, 0.004886794835329056, 0.007484935224056244, -0.006206311285495758, 0.01085750013589859, 0.029779065400362015, 0.036842215806245804, 0.038144711405038834, -0.01868445798754692, 0.046870362013578415, -0.039216913282871246, -0.025820542126893997, -0.00855698436498642, -0.03964357450604439, 0.038686010986566544, 0.015352118760347366, 0.03882897272706032, 0.041350845247507095, -0.031120920553803444, 0.011962354183197021, 0.029353830963373184, 0.023209664970636368, -0.048797737807035446, 0.01996784284710884, -0.018898963928222656, 0.007382284849882126, -0.03532733768224716, 0.023848142474889755, 0.0009282715618610382, 0.022028539329767227], [-0.047522105276584625, 0.04150816425681114, 0.04193827882409096, -0.005520235747098923, 0.02264432981610298, -0.047182321548461914, 0.02295820787549019, -0.039361048489809036, -0.03145141899585724, -0.012110412120819092, 0.03492091968655586, 0.012858066707849503, -0.016948152333498, 0.04109765216708183, -0.04225219413638115, 0.0018124356865882874, -0.020880674943327904, 0.03584101423621178, -0.015381336212158203, 0.02141920104622841, -0.002701796591281891, 0.0365506149828434, -0.026437735185027122, -9.138509631156921e-05, -0.01952815055847168, -0.0072191134095191956, 0.021478760987520218, 0.04988535866141319, -0.022324753925204277, 0.0437588132917881, 0.035360004752874374, 0.03313120827078819, -0.015837062150239944, 0.018997620791196823, -0.041881442070007324, -0.005452990531921387, -0.02944580279290676, 0.007966399192810059, -0.03310822322964668, -0.049857426434755325, -0.04010765627026558, -0.024620283395051956, -0.0040116086602211, 0.013413909822702408, -0.01809978485107422, -0.005614172667264938, 0.04775622859597206, -0.026544762775301933, -0.03676128387451172, -0.035266757011413574, -0.022351443767547607, 0.038073305040597916, -0.025638258084654808, -0.002993334084749222, -0.03930215910077095, 0.008687816560268402, -0.024591946974396706, 0.018883612006902695, 0.04961508885025978, -0.03845156356692314, 0.020413290709257126, 0.017405245453119278, 0.04345149174332619, 0.04414698854088783, 0.03616095706820488, -0.03327810764312744, 0.0333089716732502, 0.035167668014764786, -0.04254847764968872, -0.022629952058196068, 0.038336459547281265, 0.036659564822912216, -0.03832969814538956, 0.013499174267053604, 0.0474131740629673, -0.0348387137055397, -0.015946615487337112, -0.01445087045431137, -0.019444918259978294, -0.01191328838467598, -0.025900518521666527, 0.02771388366818428, -0.024574875831604004, -0.013234924525022507, 0.027033302932977676, 0.0024282224476337433, -0.03982651233673096, 0.026942137628793716, 0.018185202032327652, -0.04052715376019478, -0.003431878983974457, -0.028380680829286575, 0.02606828138232231, -0.008441232144832611, -0.027732551097869873, -0.017677687108516693, 0.0017705336213111877, 0.027002204209566116, -0.0014215223491191864, 0.011927295476198196, -0.02986619435250759, 0.02324638143181801, -0.020616983994841576, 0.012094665318727493, 0.046947840601205826, 0.010190330445766449, -0.03983635827898979, 0.04411355033516884, -0.006542779505252838, -0.04135342687368393, 0.04888853803277016, -0.03877903148531914, -0.040602076798677444, 0.018875841051340103, -0.04759183153510094, 0.012302003800868988, -0.03287293016910553, -0.04741004854440689, 0.03908630833029747, -0.013505138456821442, -0.023626983165740967, -0.0192987322807312, -0.026010489091277122, -0.025267219170928, 0.007445584982633591, 0.03962632641196251, 0.030852023512125015, 0.04455505684018135, -0.016366194933652878, 0.04156041517853737, 0.015451822429895401, 0.03795420005917549, -0.026853645220398903, 0.011293075978755951, -0.002164900302886963, 0.014522839337587357, -0.022511709481477737, 0.043729353696107864, 0.046899568289518356, -0.034027256071567535, 0.0013635754585266113, -0.03693258762359619, 0.027461592108011246, -0.019507242366671562, 0.01323780044913292, -0.0275369044393301, -0.04435882717370987, 0.0490400455892086, -0.04696084186434746, 0.029907967895269394, -0.034780800342559814, 0.04642660543322563, -0.02268807962536812, 0.020075146108865738, 0.010479830205440521, 0.006972026079893112, 0.004208136349916458, -0.03296726942062378, 0.03689536824822426, 0.04810924455523491, 0.03632119670510292, 0.027913954108953476, -0.037505436688661575, 0.03254339471459389, -0.0267336368560791, -0.03281285613775253, -0.047766637057065964, -0.03634147718548775, -0.014380861073732376, 0.008699286729097366, 0.020776938647031784, 0.012696627527475357, 0.03388761356472969, 0.01548769697546959, 0.032685015350580215, -0.021640384569764137, -0.039870359003543854, -0.013240408152341843, 0.024078253656625748, -0.017817281186580658, 0.017844680696725845, -0.03671997785568237, 0.04205450788140297, 0.004345785826444626, -0.033977486193180084, 0.017580989748239517, -0.04589405283331871, -0.03624918311834335, -0.04268542677164078, -0.025468742474913597, -0.02048196829855442, -0.00333491712808609, -0.024581683799624443, -0.01852543279528618, -0.04683208465576172, 0.003074727952480316, -0.010928202420473099, -0.038007985800504684, 0.04535745456814766, -0.03580160066485405, 0.0238603837788105, -0.0035237446427345276, 0.03418921306729317, -0.040811263024806976, -0.0470106266438961, -0.04463735967874527, -0.031096769496798515, 0.006678521633148193, 0.018722545355558395, 0.023402322083711624, -0.0218475591391325, -0.03775061294436455, 0.0437995083630085, -0.030084574595093727, -0.01594376564025879, -0.03017101250588894, -0.03012852743268013, -0.029826629906892776, 0.035396937280893326, -0.01556098461151123, -0.01450822502374649, 0.03874396160244942, 0.04868406429886818, -0.02940439060330391, -0.04053300619125366, 0.03555268421769142, -0.03242218494415283, 0.028088677674531937, -0.03023538552224636, -0.042075932025909424, -0.023586630821228027, 0.00165567547082901, -0.03497670963406563, 0.03864656761288643, 0.035007867962121964, -0.015234135091304779, -0.041036080569028854, -0.0379471555352211, -0.012961305677890778, -0.010008681565523148, 0.0006950274109840393, 0.04527571424841881, 0.006833113729953766, -0.017868507653474808, 0.011543143540620804, -0.03196221590042114, -0.0005108490586280823, -0.01876746490597725, 0.040727484971284866, 0.027766261249780655, -0.04594213888049126, -0.03877149894833565, 0.013304565101861954, 0.04594549909234047, 0.035989176481962204, -0.01770336553454399, -0.007905591279268265, -0.026770366355776787], [0.0020538456737995148, 0.022883426398038864, 0.008295200765132904, 0.002693343907594681, 0.0028518065810203552, -0.017321906983852386, 0.019616078585386276, 0.046001482754945755, 0.037252869457006454, -0.02597593143582344, -0.031165754422545433, -0.04221466928720474, -0.037179671227931976, 0.04701388254761696, -0.04392817243933678, 0.03235521540045738, -0.024250853806734085, 0.03347473219037056, 0.03475457802414894, -0.009988762438297272, 0.008155833929777145, -0.04247328266501427, 0.010250665247440338, -0.029442215338349342, 0.04410240426659584, -0.021031547337770462, 0.0461227186024189, 0.0006897822022438049, -0.004967819899320602, 0.0222121961414814, -0.009837903082370758, -0.020212937146425247, 0.03005087748169899, 0.013070736080408096, -0.03238692134618759, -0.038471270352602005, -0.013960767537355423, 0.022973094135522842, -0.0035241730511188507, 0.04015081003308296, -0.02719360589981079, 0.04554850980639458, -0.02232191525399685, -0.026593053713440895, -0.032126858830451965, -0.004069507122039795, -0.0007466301321983337, 0.04304169490933418, -0.022846436128020287, -0.030404960736632347, -0.04480929300189018, 0.04235375300049782, -0.02872682921588421, -0.034825921058654785, 0.009112726897001266, 0.030878905206918716, 0.023858431726694107, 0.022904757410287857, 0.00591663271188736, -0.037331558763980865, -0.04137260839343071, 0.023098532110452652, -0.0011888742446899414, 0.037795793265104294, 0.004400264471769333, -0.04242361709475517, -0.03166854381561279, -0.028251517564058304, 0.036151137202978134, 0.02250441536307335, 0.024294164031744003, 0.025455858558416367, 0.0463290698826313, -0.00615934282541275, -0.03257876634597778, 0.008304964751005173, -0.03980367258191109, -0.023496592417359352, -0.0007585063576698303, 0.0486653707921505, -0.0011997446417808533, 0.037703584879636765, 0.00020334869623184204, -0.017759811133146286, -0.04854501411318779, -0.020833659917116165, -0.02816173993051052, -0.019389236345887184, 0.015316855162382126, 0.04719853773713112, 0.040230248123407364, 0.049848053604364395, 0.037205662578344345, 0.029127489775419235, -0.049489330500364304, -0.03865480422973633, 0.036145951598882675, -0.025209058076143265, 0.004681192338466644, 0.021083321422338486, -0.000983644276857376, 0.002851523458957672, -0.047231078147888184, -0.001870669424533844, -0.01222771406173706, 0.027332451194524765, 0.004105139523744583, -0.0333927758038044, -0.02486717700958252, 0.016042981296777725, 0.0461050383746624, 0.006437372416257858, 0.007647324353456497, 0.046957675367593765, 0.0024034492671489716, -0.019406473264098167, 0.008466672152280807, 0.01228950172662735, -0.0051074400544166565, 0.030378248542547226, 0.04237431660294533, 0.035010065883398056, 0.03252566233277321, -0.034879229962825775, -0.030252670869231224, -0.010646581649780273, -0.02058464288711548, -0.02201254479587078, -0.012644827365875244, -0.006058037281036377, -0.0377819761633873, 0.04329290613532066, 0.0231938399374485, 0.017043616622686386, -0.017011679708957672, -0.027622664347290993, 0.022165309637784958, 0.047402072697877884, -0.003703940659761429, 0.04212493821978569, 0.018393520265817642, -0.02211838960647583, 0.0045399293303489685, 0.013185765594244003, 0.017821837216615677, 0.029000606387853622, 0.02098855748772621, 0.013061944395303726, 0.01820831373333931, -0.007980667054653168, 0.044121984392404556, 0.010078240185976028, -0.015770435333251953, 0.04249754175543785, 0.002533435821533203, -0.0044345371425151825, 0.028979841619729996, -0.019725454971194267, -0.025318516418337822, 0.03841749206185341, 0.0078362338244915, -0.00806506723165512, -0.02661428414285183, 0.03086003288626671, 0.006321035325527191, -0.0070608146488666534, -0.041008591651916504, 0.021044228225946426, 0.03192666545510292, 0.0006659403443336487, 0.04992547258734703, 0.034395065158605576, -0.017633795738220215, 0.0091279037296772, -0.01507798582315445, 0.01245952770113945, 0.040961433202028275, 0.03528979793190956, -0.031852684915065765, -0.017090726643800735, 0.03436461463570595, -0.018965983763337135, 0.049493636935949326, -0.017858754843473434, -0.0134383924305439, -0.02300213649868965, 0.032673824578523636, -0.00012878328561782837, -0.034517981112003326, -0.011214446276426315, -0.0049430616199970245, -3.0338764190673828e-05, 0.03441837802529335, -0.019894791767001152, 0.017465952783823013, 0.023653756827116013, 0.018366526812314987, 0.0008311867713928223, -0.04640672355890274, -0.004601798951625824, 0.02259841188788414, 0.037084829062223434, 0.017903555184602737, -0.007401980459690094, -0.028429651632905006, 0.015867602080106735, -0.0014972798526287079, 0.02477921172976494, -0.028502309694886208, 0.035575393587350845, -0.002198435366153717, 0.00986795499920845, -0.04025012254714966, -0.014074373990297318, 0.0230429507791996, 0.023420918732881546, -0.038811493664979935, 0.006994031369686127, -0.03355222940444946, -0.0006640329957008362, -0.023170316591858864, -0.00642549991607666, -0.02122373692691326, 0.032452572137117386, -0.02184396982192993, -0.039907027035951614, 0.043372105807065964, -0.004563044756650925, -0.01702885702252388, 0.01765204593539238, -0.04525876045227051, -0.01766207069158554, 0.024276170879602432, 0.03876857832074165, 0.005827642977237701, 0.007172238081693649, 0.01915339007973671, -0.010479331016540527, 0.027479860931634903, 0.04942664876580238, -0.043613921850919724, -0.031707488000392914, 0.024305593222379684, 0.023342836648225784, 0.04211709275841713, 0.035979632288217545, 0.02333780750632286, 0.015663769096136093, -0.017822861671447754, -0.010366640985012054, 0.02763812616467476, -0.04743566736578941, 0.04252025857567787, -0.040364015847444534, -0.041779279708862305, -0.03311573341488838, 0.0223747156560421, -0.037924159318208694], [0.0164497010409832, 0.03951976075768471, -0.047341443598270416, -0.009421229362487793, -0.04658374935388565, -0.027610326185822487, -0.0036876313388347626, -0.029459882527589798, -0.034656822681427, 0.04117553308606148, 0.019293460994958878, -0.010546766221523285, 0.02021116390824318, -0.047788191586732864, -0.0020629167556762695, -0.04509551450610161, -0.002307366579771042, 0.021636854857206345, -0.017230607569217682, -0.01580127328634262, 0.03494233265519142, 0.019674528390169144, 0.03398889675736427, -0.04703102260828018, -0.03174866735935211, -0.04963027313351631, -0.004339240491390228, 0.0072460174560546875, 0.04752625152468681, -0.011404860764741898, -0.0003731474280357361, -0.035301972180604935, -0.024386882781982422, 0.009163368493318558, -0.02267998456954956, 0.011159192770719528, -0.01206604391336441, 0.033536676317453384, -0.041357479989528656, 0.04817323759198189, 0.02668849006295204, 0.007553040981292725, -0.009562395513057709, 0.04649393633008003, 0.03356361761689186, -0.012329794466495514, 0.029288005083799362, -0.016583062708377838, 0.04786987230181694, -0.04387015104293823, 0.01971571519970894, -0.017117809504270554, -0.03569183498620987, 0.02618149295449257, 0.026496682316064835, 0.017121825367212296, -0.0003445260226726532, 0.03995107486844063, 0.004865538328886032, 0.02722989395260811, -0.016984712332487106, -0.046767234802246094, -0.004085909575223923, -0.01154996082186699, 0.030048634856939316, 0.03709911182522774, -0.035938143730163574, 0.028142694383859634, -0.04296908527612686, 0.023886192589998245, 0.021100889891386032, 0.02658095583319664, 0.027235057204961777, -0.037307024002075195, -0.04456646367907524, -0.011483944952487946, -0.04266911745071411, 0.0026617422699928284, -0.03757058456540108, 0.02849194034934044, -0.04674558714032173, 0.04076636955142021, 0.0230276919901371, 0.015088628977537155, -0.008776426315307617, 0.018289636820554733, -0.0017676465213298798, 0.0215178020298481, 0.011550914496183395, -0.03635212033987045, 0.023367080837488174, 0.015092577785253525, -0.04446908459067345, 0.02370932325720787, 0.020874980837106705, -0.01989424228668213, 0.03127891942858696, 0.033147577196359634, 0.0062453970313072205, -0.046692755073308945, -0.016453243792057037, -0.049713313579559326, 0.011517096310853958, -0.04952390119433403, -0.011754535138607025, 0.047689106315374374, -0.009805738925933838, -0.03378353267908096, -0.01529637724161148, -0.03955042362213135, -0.017144523561000824, 0.02649596706032753, -0.031899288296699524, -0.017965208739042282, -0.040948331356048584, -0.028106868267059326, -0.047905195504426956, 0.042309414595365524, -0.03311019018292427, -0.011248361319303513, -0.002989578992128372, -0.007803440093994141, 0.030364956706762314, -0.039018046110868454, 0.0042083971202373505, -0.026319777593016624, 0.031769368797540665, -0.04692695289850235, 0.001062978059053421, 0.04553569480776787, -0.006785117089748383, -0.023431647568941116, 0.03735721483826637, 0.0478951670229435, -0.014089085161685944, -0.028677238151431084, -0.04324856027960777, -0.04206497594714165, -0.01596459001302719, 0.04233882203698158, -0.0454246886074543, 0.019488003104925156, -0.04427312687039375, -0.01959589682519436, 0.032660018652677536, 0.03131909295916557, 0.01960761472582817, 0.00042183324694633484, -0.04071720689535141, -0.04924437031149864, 0.03209469094872475, 0.014891151338815689, -0.04849516227841377, -0.023733748123049736, -0.041280459612607956, -0.01873791217803955, -0.024245847016572952, 0.026044417172670364, -0.029504453763365746, 0.0037852302193641663, -0.03239935636520386, 0.007889904081821442, -0.04762982204556465, 0.022784415632486343, -0.013017844408750534, 0.01733968034386635, 0.04049183055758476, -0.019428540021181107, -0.021876836195588112, 0.04363719001412392, -0.01668332889676094, 0.005175650119781494, 0.03194347396492958, -0.016517482697963715, 0.029178153723478317, 0.04385104402899742, -0.02612321451306343, -0.04266904667019844, 0.014744985848665237, -0.04995784908533096, 0.029176298528909683, 0.0027003400027751923, 0.02310110256075859, -0.009272336959838867, -0.002252865582704544, 0.030948150902986526, 0.02742781862616539, -0.01831502839922905, -0.008773468434810638, 0.02990664169192314, -0.009732328355312347, 0.022664938122034073, -0.027173936367034912, -0.010972607880830765, 0.009515725076198578, 0.014786254614591599, -0.025186752900481224, -0.044827427715063095, -0.009104825556278229, 0.01965956762433052, -0.035049308091402054, 0.04471191391348839, 0.043717969208955765, -0.036154113709926605, -0.00570901483297348, -0.010496068745851517, 0.0051514506340026855, -0.011832140386104584, -0.04921272024512291, 0.016822192817926407, -0.013199437409639359, -0.04069627448916435, 0.048061553388834, -0.024741649627685547, 0.02871387079358101, 0.003611169755458832, -0.0018225200474262238, -0.026472806930541992, -0.022803688421845436, -0.043425049632787704, -0.013501264154911041, -0.035731565207242966, -0.03123626671731472, -0.041272640228271484, 0.021066714078187943, 0.027711283415555954, -0.0074599385261535645, 0.03612921014428139, 0.039377521723508835, -0.023861730471253395, -0.01854710653424263, 0.039120662957429886, -0.006520651280879974, -0.005079984664916992, 0.016824278980493546, 0.031451594084501266, -0.04418608173727989, 0.01969117298722267, 0.031658854335546494, 0.02979450300335884, 0.011742115020751953, -0.02570122480392456, 0.04475822672247887, -0.038929738104343414, -0.007927298545837402, 0.03651510551571846, -0.030152535066008568, 0.00857863575220108, 0.0013303644955158234, -0.015175938606262207, -0.018337618559598923, 0.029132772237062454, 0.023926224559545517, -0.0003005973994731903, 0.02223670855164528, -0.04981974512338638, -0.023139500990509987, 0.015076939016580582], [0.0039025768637657166, 0.026625219732522964, 0.01965731754899025, -0.04251907020807266, -0.03138284757733345, -0.04490116983652115, -0.012411095201969147, -0.04118620231747627, 0.01375875249505043, 0.028586748987436295, -0.04558094963431358, 0.007179044187068939, 0.026836823672056198, -0.016894828528165817, 0.005369067192077637, 0.039733778685331345, -0.049468912184238434, -0.009303640574216843, 0.030547287315130234, 0.024163413792848587, -0.013482391834259033, -0.004492618143558502, 0.04163319244980812, 0.017656970769166946, -0.032090820372104645, 0.03376063331961632, -0.0439133420586586, 0.0001421794295310974, 0.006921194493770599, 0.032469574362039566, 0.018647875636816025, 0.02566680684685707, -0.0054493919014930725, -0.027515221387147903, 0.03126319870352745, 0.04682213440537453, 0.013195503503084183, -0.005354605615139008, 0.025121483951807022, -0.04512312635779381, -0.026626432314515114, 0.009023629128932953, 0.005060233175754547, 0.01582937315106392, 0.012110136449337006, -0.028903961181640625, -0.03795935958623886, -0.04530537128448486, -0.006086312234401703, 0.008994102478027344, -0.022399498149752617, 0.03999737277626991, -0.002309095114469528, -0.00338137149810791, 0.027649130672216415, -0.0009375587105751038, 0.023993853479623795, -0.017917443066835403, -0.027817463502287865, 0.0216897614300251, 0.049519408494234085, 0.0016462095081806183, -0.03224783018231392, -0.042308758944272995, 0.013008881360292435, 0.0340585820376873, -0.013785075396299362, 0.030937109142541885, -0.02080855332314968, 0.029159199446439743, -0.02759542502462864, 0.01115032285451889, -0.02831432782113552, -0.025368213653564453, 0.020170535892248154, -0.002654802054166794, 0.035848844796419144, 0.014716867357492447, 0.0006880760192871094, 0.04873185232281685, -0.026286661624908447, 0.04489791765809059, 0.003572903573513031, 0.017421554774045944, 0.010821722447872162, 0.039242420345544815, -0.0219514612108469, 0.03382176533341408, 0.007018983364105225, 0.02629070356488228, 0.014497008174657822, 2.7261674404144287e-05, -0.023029519245028496, 0.006535924971103668, 0.04317435249686241, 0.01448342576622963, -0.005796812474727631, 0.01751246675848961, -0.03630415350198746, -0.005018197000026703, 0.04094170406460762, 0.006161749362945557, -0.030107665807008743, 0.009512532502412796, -0.01040416955947876, 0.04860750213265419, -0.02471407689154148, -0.012087404727935791, 0.047462765127420425, -0.032655321061611176, 0.015435051172971725, 0.049564387649297714, 0.029317449778318405, -0.025696922093629837, -0.0030717626214027405, 0.023957911878824234, -0.022088278084993362, 0.04467913880944252, -0.03951151296496391, -0.03550795465707779, -0.046518661081790924, -0.0378127321600914, -0.01234055683016777, -0.026690542697906494, 0.02404150739312172, -0.03754938766360283, 0.046972181648015976, 0.018424246460199356, -0.03894573450088501, -0.00041679292917251587, -0.046179354190826416, 0.038433972746133804, 0.011822033673524857, 0.04977882280945778, -0.009662806987762451, -0.017509449273347855, 0.027585912495851517, -0.02708648517727852, 0.031167957931756973, 0.04627693071961403, -0.019113434478640556, 0.01846155896782875, -0.03438210487365723, 0.0337715782225132, 0.022002365440130234, -0.018484055995941162, 0.03623075410723686, 0.00858372449874878, 0.03701896592974663, -0.015524469316005707, -0.017500150948762894, 0.030232321470975876, 0.0021681413054466248, -0.03779219463467598, 0.018482696264982224, -0.031899917870759964, 0.03684817627072334, 0.046685341745615005, 0.0032415390014648438, -0.01629725843667984, -0.025155281648039818, -0.039638616144657135, -0.04322993755340576, -0.04168853908777237, -0.007987748831510544, -0.0143660306930542, -0.027690982446074486, 0.033024195581674576, 0.029025141149759293, 0.0259581096470356, -0.026519179344177246, -0.04964574798941612, 0.023753594607114792, -0.03350804001092911, -0.04080531746149063, -0.006308555603027344, 0.04663478210568428, 0.02800368145108223, 0.021700028330087662, 0.042449627071619034, -0.025995278730988503, -0.02598978392779827, 0.040418077260255814, 0.04350311681628227, -0.008323632180690765, -0.005406878888607025, -0.021589649841189384, 0.015192840248346329, -0.022313380613923073, -0.024137843400239944, -0.030055617913603783, 0.010570049285888672, -0.007012307643890381, 0.015636924654245377, 0.009311698377132416, -0.026187920942902565, 0.00826193019747734, 0.03187105432152748, -0.013789772987365723, 0.049898672848939896, -0.03732581064105034, -0.012333046644926071, 0.03016136959195137, 0.028218958526849747, 0.0023275837302207947, -0.047495294362306595, 0.02171972021460533, 0.03482446447014809, 0.005971111357212067, -0.03127960115671158, 0.033866237848997116, -0.004543017596006393, -0.047309041023254395, -0.0048250071704387665, -0.031220722943544388, -0.005762256681919098, 0.0019692666828632355, -0.0033797025680541992, 0.028035271912813187, -0.043267786502838135, 0.014851700514554977, 0.037663113325834274, 0.038803283125162125, 0.012800786644220352, 0.04076780006289482, 0.04575258865952492, 0.04995400831103325, -0.0023573637008666992, 0.005960643291473389, -0.019205737859010696, -0.0068871378898620605, 0.024714019149541855, 0.041250500828027725, -0.0250704288482666, 0.024641644209623337, -0.024955976754426956, 0.033134255558252335, 0.013383474200963974, 0.015408802777528763, 0.043079618364572525, 0.047752346843481064, -0.01231076568365097, 0.02410029247403145, 0.023939315229654312, -0.0036881789565086365, -0.031877804547548294, 0.03368495777249336, -0.02749077044427395, 0.045651379972696304, -0.02474318817257881, -0.022745490074157715, 0.009271860122680664, -0.01834026724100113, 0.03804370388388634, -0.0002638101577758789, -0.03030465915799141, -0.04739312082529068, 0.03736593946814537], [-0.0027418360114097595, -0.0086158886551857, -0.047505464404821396, 0.01544802263379097, 0.03252512589097023, 0.037287209182977676, 0.013746712356805801, 0.013671305030584335, 0.018316272646188736, 0.018810298293828964, 0.023253824561834335, 0.043540071696043015, -0.04721493646502495, 0.004764270037412643, -0.04676853492856026, -9.912252426147461e-05, -0.04822944477200508, 0.016615476459264755, -0.04566037654876709, -0.0405135378241539, 0.0497167743742466, -0.01918591372668743, -0.04101673513650894, 0.022811558097600937, 0.035315487533807755, -0.018076885491609573, -0.034625064581632614, 0.006699420511722565, 0.03976023569703102, -0.021533919498324394, 0.030060503631830215, -0.015824854373931885, 0.005932461470365524, 0.020149197429418564, 0.018222998827695847, 0.02522682026028633, -0.04495663568377495, 0.004248809069395065, 0.0009878277778625488, -0.02064352110028267, 0.03482390567660332, 0.029108751565217972, -0.04702479764819145, -0.042425669729709625, 0.04655696079134941, 0.032708410173654556, -0.04612342268228531, -0.03521005064249039, 0.0004297979176044464, 0.008388541638851166, 0.02355499193072319, -0.03138895332813263, 0.028234336525201797, 0.022570621222257614, -0.04576612636446953, 0.04395124688744545, -0.045923780649900436, 0.009402025490999222, 0.01986277475953102, -0.016731657087802887, -0.03079777956008911, 0.0055218711495399475, 0.027192603796720505, 0.04900376871228218, -0.00951451063156128, 0.01971552148461342, -0.049360599368810654, 0.0025236383080482483, 0.03222948685288429, 0.0003815293312072754, -0.04551566764712334, -0.04948984459042549, 0.049005378037691116, 0.021292660385370255, -0.01076127216219902, -0.030688881874084473, -0.03990988805890083, -0.04326909780502319, 0.004321347922086716, -0.04453842714428902, -0.03159525245428085, 0.04376325383782387, -0.00804581493139267, -0.04740973934531212, 0.047529902309179306, 0.0026431456208229065, -0.011675965040922165, 0.008503567427396774, -0.015133164823055267, 0.009318172931671143, 0.027781520038843155, -0.028827238827943802, 0.0019216164946556091, -0.030742919072508812, 0.012115977704524994, 0.008887220174074173, 0.02707202360033989, 0.010711979120969772, 0.04150797054171562, 0.024794187396764755, 0.04290599748492241, -0.007292211055755615, -0.008427310734987259, -0.03293699026107788, -0.015053819864988327, -0.00614166259765625, -0.03849679231643677, 0.009074818342924118, -0.04746463522315025, 0.04632860794663429, 0.006673932075500488, 0.030139628797769547, 0.007038235664367676, 0.04665705934166908, -0.04479353502392769, -0.03812659904360771, 0.015552107244729996, -0.04437733814120293, 0.004588078707456589, 0.021741751581430435, -0.0036253221333026886, -0.04505104944109917, -0.04316225275397301, 0.0073780640959739685, 0.04822739586234093, -0.013868510723114014, 0.026711490005254745, -0.04447153955698013, 0.045236218720674515, 0.001657295972108841, -0.040277350693941116, 0.03744398429989815, 0.03940446302294731, 0.010885260999202728, 0.03913375362753868, -0.022601712495088577, -0.040749095380306244, 0.02929617092013359, 0.025417450815439224, -0.01817397028207779, -0.034116290509700775, 0.03805854544043541, -0.04483615234494209, -0.03498896211385727, 0.008911121636629105, -0.014751672744750977, -0.028139209374785423, -0.024138355627655983, 0.00222175195813179, 0.04723573103547096, 0.0451929084956646, -0.013932418078184128, -0.010366998612880707, 0.009378589689731598, -0.03856780380010605, -0.03037215583026409, -0.045371245592832565, 0.026103053241968155, -0.01922919787466526, -0.01846865564584732, 0.019435513764619827, 0.012437142431735992, 0.0028820857405662537, -0.029955411329865456, 0.0321568138897419, 0.03303675726056099, 0.006371844559907913, 0.028485026210546494, 0.03891478851437569, -0.019908452406525612, 0.009158134460449219, -0.02021613158285618, -0.035590577870607376, 0.016659442335367203, 0.008608736097812653, -0.019381463527679443, -0.04854285717010498, 0.045728135854005814, 0.014717642217874527, -0.04381820186972618, 0.016146313399076462, -0.044212352484464645, -0.033955492079257965, -0.0016891472041606903, 0.011007450520992279, -0.0017675384879112244, -0.03596857935190201, 0.0442931093275547, 0.008122600615024567, 0.030853930860757828, 0.03423180803656578, 0.011135481297969818, 0.013172972947359085, 0.015784744173288345, 0.006638824939727783, -0.0005202069878578186, -0.03318784385919571, -0.04415861517190933, -0.043131183832883835, 0.01617593690752983, -0.0021506063640117645, -0.04115048795938492, 0.018444646149873734, -0.04632297903299332, -0.04919937998056412, -0.03402022272348404, 0.046092163771390915, -0.01043553277850151, 0.03209221735596657, -0.01788219064474106, -0.03090648725628853, 0.009674299508333206, 0.04247415438294411, 0.038596298545598984, 0.036337558180093765, -0.01752685382962227, 0.011984039098024368, -0.047726940363645554, -0.018252573907375336, -0.03650469705462456, 0.04913485422730446, -0.0217583067715168, 0.046810124069452286, 0.027842488139867783, -0.037722837179899216, 0.0035160891711711884, -0.012644220143556595, 0.04828120395541191, -0.04065293073654175, -0.02144831418991089, 0.041754793375730515, -0.036247432231903076, -0.008466623723506927, -0.007117174565792084, 0.04929102584719658, -0.016108345240354538, 0.040693607181310654, 0.046786677092313766, 0.01303926482796669, -0.008469365537166595, -0.007227383553981781, 0.009408663958311081, 0.030861448496580124, -0.023949790745973587, -0.02337285317480564, -0.03323572874069214, 0.03972477838397026, 0.0007552392780780792, -0.023041320964694023, -0.022010255604982376, 0.04908778890967369, -0.002030886709690094, -0.029971515759825706, 0.0403444804251194, 0.03174709156155586, -0.006597675383090973, -0.003344189375638962, -0.01992594078183174], [0.0005473718047142029, 0.043264638632535934, -0.026911724358797073, 0.02590790018439293, 0.027538705617189407, 0.04871375486254692, 0.003376174718141556, -0.004902351647615433, -0.032784126698970795, 0.014293398708105087, -0.02904890850186348, -0.03675264120101929, 0.04345432296395302, -0.02651428058743477, -0.02421361207962036, 0.004793204367160797, -0.03371546417474747, -0.027579082176089287, 0.03175833448767662, -0.027325404807925224, 0.02894022688269615, -0.04521627351641655, -0.02895047701895237, 0.023377690464258194, -0.01384364441037178, 0.019434820860624313, -0.01122216135263443, -0.010279763489961624, 0.03709261491894722, -0.007647715508937836, 0.01017916202545166, -0.047899555414915085, 0.018578719347715378, -0.03414280712604523, 0.04057207331061363, 0.03496882691979408, 0.021066535264253616, -0.0027525797486305237, -0.004175208508968353, 0.03148701414465904, 0.027435291558504105, -0.03161092847585678, -0.0443124882876873, -0.03244950622320175, -0.01156308501958847, -0.025386644527316093, -0.0072054751217365265, 0.022288966923952103, 0.018355432897806168, 0.01207340881228447, 0.01949918642640114, -0.033612027764320374, -0.0464511401951313, 0.025977108627557755, 0.012090347707271576, 0.006151773035526276, -0.014370512217283249, -0.03263379633426666, 0.03919582441449165, -0.036238860338926315, -0.03046211041510105, -0.04283269867300987, 0.0017012953758239746, -0.042508114129304886, -0.03233980014920235, 0.048966798931360245, 0.04103853926062584, -0.03063802793622017, 0.02558717504143715, 0.00788658857345581, 0.016796600073575974, -0.00013911724090576172, -0.016793716698884964, 0.03184828534722328, -0.007491160184144974, 0.005852781236171722, 0.013726640492677689, 0.006901729851961136, -0.018690668046474457, 0.0016921386122703552, 0.003664076328277588, -0.04513827711343765, -0.048328448086977005, 0.04685988649725914, 0.004384707659482956, -0.0465550534427166, -0.04203217104077339, -0.04860299825668335, -0.02998635731637478, -0.022398317232728004, -0.02438650093972683, 0.020991872996091843, 0.0020579583942890167, -0.037625253200531006, 0.036854688078165054, 0.020449791103601456, -0.01770789548754692, 0.03062434121966362, -0.023761320859193802, 0.011278867721557617, -0.030416762456297874, 0.0055839903652668, -0.04349247366189957, -0.005270801484584808, -0.01587488502264023, 0.02700413390994072, 0.025859247893095016, 0.0021634697914123535, -0.0335284098982811, 0.019447695463895798, -0.0012370124459266663, -0.023639703169465065, 0.03889456018805504, -0.039164938032627106, 0.03291771188378334, 0.0011622905731201172, 0.02808859571814537, -0.007151879370212555, -0.00021630525588989258, 0.039581965655088425, 0.03641659393906593, -0.016870785504579544, -0.047040294855833054, -0.008880723267793655, -0.04909404739737511, 0.021006319671869278, 0.026904437690973282, 0.021287012845277786, -0.039245616644620895, 0.0030808933079242706, -0.0011167898774147034, 0.03082754835486412, -0.027717996388673782, 0.03218935802578926, 0.04760248586535454, -0.03203382343053818, -0.04945145919919014, 0.03849451616406441, 0.04048644378781319, 0.019633416086435318, 0.04099459573626518, 0.035961974412202835, 0.022978369146585464, 0.01725054904818535, 0.003601871430873871, 0.019800696521997452, 0.008537746965885162, -0.01254359632730484, 0.03642627224326134, -0.03629380464553833, 0.04579640552401543, 0.040354203432798386, -0.012101136147975922, -0.020427240058779716, 0.013231348246335983, 0.0366903580725193, -0.006707966327667236, -0.03561367839574814, 0.016785267740488052, 0.00206921249628067, 0.015383336693048477, -0.015342522412538528, 0.03132820501923561, 0.03278635814785957, 0.012578237801790237, -0.03926103189587593, 0.04252585396170616, -0.003788091242313385, -0.04563462734222412, 0.03512224182486534, 0.009960781782865524, -0.009726487100124359, -0.006617724895477295, -0.043758977204561234, 0.03926168754696846, 0.022326495498418808, 0.04851524904370308, -0.005445502698421478, -0.006627548485994339, 0.03713853284716606, 0.008780062198638916, -0.04633201286196709, -0.04887425899505615, 0.04311997815966606, 0.04654422774910927, -0.01501680538058281, -0.028850270435214043, -0.0414234884083271, 0.02911616489291191, -0.011375892907381058, -0.0045477524399757385, -0.0062913671135902405, 0.0030673518776893616, 0.04610283300280571, -0.04959148168563843, 0.027871761471033096, -0.012776721268892288, -0.019920026883482933, -0.012377358973026276, -0.013406097888946533, -0.021644724532961845, 0.04307711496949196, -0.014022432267665863, -0.0005478635430335999, -0.021190954372286797, 0.044547054916620255, -0.022630691528320312, -0.021662533283233643, 0.01380724087357521, -0.043762218207120895, 0.030813876539468765, -0.02433185651898384, -0.042274560779333115, 0.010592758655548096, -0.007942043244838715, 0.002924703061580658, 0.015182506293058395, 0.00279911607503891, -0.013960160315036774, -0.018821705132722855, -0.022467566654086113, 0.014376197010278702, 0.04006487503647804, -0.040825046598911285, 0.018424365669488907, 0.007068894803524017, 0.04504084959626198, 0.03422774001955986, -0.030315840616822243, -0.021354949101805687, -0.0027534253895282745, -0.03611637279391289, -0.03601555898785591, 0.01814580336213112, 0.020335305482149124, 0.005090296268463135, -0.04374467208981514, 0.012864295393228531, 0.012251496315002441, 0.030682098120450974, 0.003430783748626709, -0.007002554833889008, -0.036375559866428375, 0.01922619715332985, 0.04142621532082558, -0.04648194462060928, -0.0038322806358337402, -0.01901613548398018, -0.008677087724208832, 0.013992752879858017, 0.011346660554409027, -0.04655792936682701, 0.021453727036714554, -0.01825251430273056, -0.04885953664779663, 0.028843794018030167, -0.030286801978945732, -0.03044426441192627], [-0.028221679851412773, -0.0393986813724041, -0.013929642736911774, 0.011915922164916992, 0.006367433816194534, 0.00711832195520401, 0.02984422817826271, 0.03646305575966835, 0.012550298124551773, -0.02925398387014866, 0.04692644253373146, -0.03407333046197891, -0.027370095252990723, 0.019919898360967636, 0.0030533671379089355, -0.04888845607638359, -0.038323353976011276, 0.020607363432645798, 0.03632834181189537, -0.004184603691101074, -0.027293099090456963, -0.04489260911941528, -0.016120433807373047, 0.011803485453128815, -0.01592651754617691, -0.02586236037313938, -0.004162870347499847, -0.043985914438962936, 0.03526449576020241, -0.027948200702667236, 0.03203848376870155, 0.029435407370328903, 0.01941988244652748, -0.024894608184695244, -0.0388413667678833, -0.04662393406033516, -0.008458755910396576, -0.021535396575927734, -0.016699742525815964, 0.024586711078882217, -0.04369833692908287, 0.012282408773899078, 0.04961242899298668, 0.03489970043301582, -0.007101345807313919, -0.028897082433104515, 0.024043623358011246, -0.024316979572176933, 0.011643122881650925, 0.04915570095181465, 0.016131367534399033, -0.006777238100767136, 0.04830888286232948, 0.03406010940670967, 0.017783377319574356, -0.0321422703564167, 0.03425997868180275, 0.019296836107969284, -0.03406746685504913, 0.04663151875138283, -0.012545488774776459, -0.013556670397520065, -0.04344205930829048, 0.042274344712495804, -0.03560375049710274, -0.0068454742431640625, -0.025134671479463577, -0.00189291313290596, 0.020337391644716263, -0.03540628030896187, -0.04362034797668457, 0.03254956379532814, 0.010087955743074417, -0.03783692046999931, -0.007146060466766357, 0.024740207940340042, 0.003437541425228119, -0.02094876766204834, 0.0370669849216938, 0.027385268360376358, -0.02356560342013836, -0.0019503459334373474, -0.0011362917721271515, 0.014610636979341507, -0.016474533826112747, 0.023820314556360245, -0.026417279615998268, -0.03971003368496895, -0.016484595835208893, -0.02131408452987671, 0.014581713825464249, 0.045235756784677505, 0.012286446988582611, -0.0061768777668476105, 0.04649991914629936, 0.031941305845975876, -0.0024151094257831573, 0.04973551258444786, -0.04779905080795288, 0.0007812492549419403, -0.0009673014283180237, -0.0023529641330242157, 0.032227229326963425, 0.0009603016078472137, -0.0002483949065208435, -0.011993207037448883, -0.03620211035013199, -0.03767772763967514, 0.02771778032183647, -0.049481701105833054, -0.022530604153871536, -0.038487792015075684, 0.04702598229050636, 0.045180413872003555, 0.027165185660123825, -0.011135995388031006, -0.008614767342805862, 0.0360930897295475, 0.04686201736330986, -0.04585644230246544, -0.03382498025894165, -0.009111881256103516, -0.005307983607053757, 0.030464421957731247, -0.008055530488491058, 0.005398869514465332, 0.0012928135693073273, -0.03746018558740616, 0.04084591940045357, -0.03128904104232788, 0.04746958240866661, 0.004083562642335892, 0.0013460516929626465, 0.009187448769807816, 0.04427068307995796, -0.006669461727142334, 0.0171700157225132, -0.025685681030154228, 0.049998704344034195, -0.030442476272583008, 0.01322099193930626, -0.03321889787912369, 0.016586843878030777, 0.020805541425943375, 0.04899707809090614, 0.034708667546510696, 0.04086482897400856, -0.01929030381143093, -0.012436844408512115, -0.04634838178753853, -0.01320737600326538, 0.013180617243051529, -0.04952547699213028, -0.0060432665050029755, 0.043099965900182724, 0.047719646245241165, 0.005933605134487152, 0.019925717264413834, -0.0105094313621521, 0.01173466444015503, 0.039182279258966446, 0.037679385393857956, -0.04141286760568619, 0.030749309808015823, 